Lambosaurus/STM32X/Lib/UART.c

#include "UART.h"

#include "Core.h"
#include "GPIO.h"
#include "CLK.h"
#include "IRQ.h"

/*
 * PRIVATE DEFINITIONS
 */

#ifndef USART_CR1_M0
#define USART_CR1_M0 USART_CR1_M
#endif

#if defined(STM32G0) || defined(STM32WL)
#define USART_CR1_RXNEIE				USART_CR1_RXNEIE_RXFNEIE
#define USART_CR1_TXEIE					USART_CR1_TXEIE_TXFNFIE
#define USART_ISR_RXNE					USART_ISR_RXNE_RXFNE
#define USART_ISR_TXE					USART_ISR_TXE_TXFNF
#endif

#define __UART_RX_ENABLE(uart) 	(uart->Instance->CR1 |= USART_CR1_RXNEIE)
#define __UART_RX_DISABLE(uart) (uart->Instance->CR1 &= ~USART_CR1_RXNEIE)
#define __UART_TX_ENABLE(uart) 	(uart->Instance->CR1 |= USART_CR1_TXEIE)
#define __UART_TX_DISABLE(uart) (uart->Instance->CR1 &= ~USART_CR1_TXEIE)
#define __UART_TX_BUSY(uart)	(!(uart->Instance->ISR & USART_ISR_TC))
#define __UART_CLEAR_FLAGS(uart, flags) (uart->Instance->ICR |= flags)

#ifndef UART_IRQ_PRIO
#define UART_IRQ_PRIO					1
#endif //UART_IRQ_PRIO

/*
 * PRIVATE TYPES
 */

/*
 * PRIVATE PROTOTYPES
 */

static void UARTx_Init(UART_t * uart);
static void UARTx_Deinit(UART_t * uart);

/*
 * PRIVATE VARIABLES
 */

#ifdef UARTLP_PINS
static UART_t gUART_LP = {
	.Instance = LPUART1
};
UART_t * const UART_LP = &gUART_LP;
#endif
#ifdef UART1_PINS
static UART_t gUART_1 = {
	.Instance = USART1
};
UART_t * const UART_1 = &gUART_1;
#endif
#ifdef UART2_PINS
static UART_t gUART_2 = {
	.Instance = USART2
};
UART_t * const UART_2 = &gUART_2;
#endif
#ifdef UART3_PINS
static UART_t gUART_3 = {
	.Instance = USART3
};
UART_t * const UART_3 = &gUART_3;
#endif
#ifdef UART4_PINS
static UART_t gUART_4 = {
	.Instance = USART4
};
UART_t * const UART_4 = &gUART_4;
#endif
#ifdef UART5_PINS
static UART_t gUART_5 = {
	.Instance = USART5
};
UART_t * const UART_5 = &gUART_5;
#endif
#ifdef UART6_PINS
static UART_t gUART_6 = {
	.Instance = USART6
};
UART_t * const UART_6 = &gUART_6;
#endif

/*
 * PUBLIC FUNCTIONS
 */


void UART_Init(UART_t * uart, uint32_t baud, UART_Mode_t mode)
{
	FIFO_Init(&uart->tx);
	FIFO_Init(&uart->rx);

	// Enable the uart specific GPIO and clocks.
	UARTx_Init(uart);

	__HAL_UART_DISABLE(uart);
	// Configure to standard settings: 8N1, no flow control.
	uint32_t cr1 = (uint32_t)UART_WORDLENGTH_8B | UART_PARITY_NONE | UART_MODE_TX_RX | UART_OVERSAMPLING_16;
	uint32_t cr2 = UART_STOPBITS_1;
	uint32_t cr3 = (uint32_t)UART_HWCONTROL_NONE | UART_ONE_BIT_SAMPLE_DISABLE;

	if (mode & UART_Mode_Inverted) 		{ cr2 |= USART_CR2_RXINV | USART_CR2_TXINV; }
	if (mode & UART_Mode_Swap) 			{ cr2 |= USART_CR2_SWAP; }
	// The M bit here changes the frame size to 9 bits.
	// The parity bit counts as part of the frame.
	if (mode & UART_Mode_EvenParity) 	{ cr1 |= USART_CR1_PCE | USART_CR1_M0; }
	if (mode & UART_Mode_OddParity) 	{ cr1 |= USART_CR1_PCE | USART_CR1_PS | USART_CR1_M0; }

	const uint32_t cr1msk = USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE | USART_CR1_RE | USART_CR1_OVER8;
	MODIFY_REG(uart->Instance->CR1, cr1msk,	cr1);

	const uint32_t cr2msk = USART_CR2_STOP | USART_CR2_RXINV | USART_CR2_TXINV | USART_CR2_SWAP | USART_CR2_LINEN | USART_CR2_CLKEN;
	MODIFY_REG(uart->Instance->CR2, cr2msk, cr2);

	const uint32_t cr3msk = USART_CR3_RTSE | USART_CR3_CTSE | USART_CR3_ONEBIT | USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN;
	MODIFY_REG(uart->Instance->CR3, cr3msk, cr3);

	// Calculate baud rate.
	uint32_t pclk = CLK_GetPCLKFreq();

#ifdef UARTLP_PINS
	if (UART_INSTANCE_LOWPOWER(uart))
	{
#if defined(STM32G0) || defined(STM32WL)
		uart->Instance->BRR = UART_DIV_LPUART(pclk, baud, UART_PRESCALER_DIV1);
#else
		uart->Instance->BRR = UART_DIV_LPUART(pclk, baud);
#endif
	}
	else
#endif
	{
#if defined(STM32G0) || defined(STM32WL)
		uart->Instance->BRR = UART_DIV_SAMPLING16(pclk, baud, UART_PRESCALER_DIV1);
#else
		uart->Instance->BRR = UART_DIV_SAMPLING16(pclk, baud);
#endif
	}
	__HAL_UART_ENABLE(uart);

	// Enable RX IRQ.
	__UART_RX_ENABLE(uart);
}

void UART_Deinit(UART_t * uart)
{
	// Disable RX IRQ, and TX IRQ in case a tx is underway.
	__UART_RX_DISABLE(uart);
	__UART_TX_DISABLE(uart);

	__HAL_UART_DISABLE(uart);
	// Clear all control registers.
	uart->Instance->CR1 = 0x0U;
	uart->Instance->CR2 = 0x0U;
	uart->Instance->CR3 = 0x0U;

	// Disable uart specific GPIO and clocks.
	UARTx_Deinit(uart);
}

void UART_Write(UART_t * uart, const uint8_t * data, uint32_t count)
{
	while (count)
	{
		uint32_t written = FIFO_Write(&uart->tx, data, count);
		data += written;
		count -= written;

		__UART_TX_ENABLE(uart);

		if (count)
		{
			// TX is full. Stall for a bit.
			CORE_Idle();
		}
	}
}

void UART_WriteStr(UART_t * uart, const char * str)
{
	UART_Write(uart, (const uint8_t *)str, strlen(str));
}

uint32_t UART_ReadCount(UART_t * uart)
{
	return FIFO_Count(&uart->rx);
}

uint32_t UART_Read(UART_t * uart, uint8_t * data, uint32_t count)
{
	return FIFO_Read(&uart->rx, data, count);
}

uint8_t UART_Pop(UART_t * uart)
{
	return FIFO_BlindPop(&uart->rx);
}

void UART_ReadFlush(UART_t * uart)
{
	FIFO_Clear(&uart->rx);
}

void UART_WriteFlush(UART_t * uart)
{
	while (UART_WriteCount(uart))
	{
		CORE_Idle();
	}
}

uint32_t UART_WriteCount(UART_t * uart)
{
	// Include the outgoing character
	uint32_t count = FIFO_Count(&uart->tx);
	if (__UART_TX_BUSY(uart)) { count ++; }
	return count;
}

/*
 * PRIVATE FUNCTIONS
 */

static void UARTx_Init(UART_t * uart)
{
#ifdef UARTLP_PINS
	if (uart == UART_LP)
	{
		__HAL_RCC_LPUART1_CLK_ENABLE();
		GPIO_EnableAlternate(UARTLP_PINS, 0, UARTLP_AF);
		IRQ_Enable(IRQ_No_LPUART1, UART_IRQ_PRIO);
	}
#endif
#ifdef UART1_PINS
	if (uart == UART_1)
	{
		__HAL_RCC_USART1_CLK_ENABLE();
		GPIO_EnableAlternate(UART1_PINS, 0, UART1_AF);
		IRQ_Enable(IRQ_No_UART1, UART_IRQ_PRIO);
	}
#endif
#ifdef UART2_PINS
	if (uart == UART_2)
	{
		__HAL_RCC_USART2_CLK_ENABLE();
		GPIO_EnableAlternate(UART2_PINS, 0, UART2_AF);
		IRQ_Enable(IRQ_No_UART2, UART_IRQ_PRIO);
	}
#endif
#ifdef UART3_PINS
	if (uart == UART_3)
	{
		__HAL_RCC_USART3_CLK_ENABLE();
		GPIO_EnableAlternate(UART3_PINS, 0, UART3_AF);
		IRQ_Enable(IRQ_No_UART3, UART_IRQ_PRIO);
	}
#endif
#ifdef UART4_PINS
	if (uart == UART_4)
	{
		__HAL_RCC_USART4_CLK_ENABLE();
		GPIO_EnableAlternate(UART4_PINS, 0, UART4_AF);
		IRQ_Enable(IRQ_No_UART4, UART_IRQ_PRIO);
	}
#endif
#ifdef UART5_PINS
	if (uart == UART_5)
	{
		__HAL_RCC_USART5_CLK_ENABLE();
		GPIO_EnableAlternate(UART5_PINS, 0, UART5_AF);
		IRQ_Enable(IRQ_No_UART5, UART_IRQ_PRIO);
	}
#endif
#ifdef UART6_PINS
	if (uart == UART_6)
	{
		__HAL_RCC_USART6_CLK_ENABLE();
		GPIO_EnableAlternate(UART6_PINS, 0, UART6_AF);
		IRQ_Enable(IRQ_No_UART6, UART_IRQ_PRIO);
	}
#endif
}

static void UARTx_Deinit(UART_t * uart)
{
#ifdef UARTLP_PINS
	if (uart == UART_LP)
	{
		__HAL_RCC_LPUART1_CLK_DISABLE();
		GPIO_Deinit(UARTLP_PINS);
	}
#endif
#ifdef UART1_PINS
	if (uart == UART_1)
	{
		__HAL_RCC_USART1_CLK_DISABLE();
		GPIO_Deinit(UART1_PINS);
	}
#endif
#ifdef UART2_PINS
	if (uart == UART_2)
	{
		__HAL_RCC_USART2_CLK_DISABLE();
		GPIO_Deinit(UART2_PINS);
	}
#endif
#ifdef UART3_PINS
	if (uart == UART_3)
	{
		__HAL_RCC_USART3_CLK_DISABLE();
		GPIO_Deinit(UART3_PINS);
	}
#endif
#ifdef UART4_PINS
	if (uart == UART_4)
	{
		__HAL_RCC_USART4_CLK_DISABLE();
		GPIO_Deinit(UART4_PINS);
	}
#endif
#ifdef UART5_PINS
	if (uart == UART_5)
	{
		__HAL_RCC_USART5_CLK_DISABLE();
		GPIO_Deinit(UART5_PINS);
	}
#endif
#ifdef UART6_PINS
	if (uart == UART_6)
	{
		__HAL_RCC_USART6_CLK_DISABLE();
		GPIO_Deinit(UART6_PINS);
	}
#endif
}

/*
 * INTERRUPT ROUTINES
 */

void UART_IRQHandler(UART_t *uart)
{
	uint32_t flags = uart->Instance->ISR;

	if (flags & USART_ISR_RXNE)
	{
		uint8_t rxb = uart->Instance->RDR;
		FIFO_Put(&uart->rx, rxb);
	}

	if (flags & USART_ISR_TXE)
	{
		uint8_t txb;
		if (FIFO_Pop(&uart->tx, &txb))
		{
			uart->Instance->TDR = txb;
		}
		else
		{
			// No more data. Stop.
			__UART_TX_DISABLE(uart);
		}
	}

	if (flags & (USART_ISR_ORE | USART_ISR_PE | USART_ISR_NE | USART_ISR_FE))
	{
		__UART_CLEAR_FLAGS(uart, (UART_CLEAR_PEF | UART_CLEAR_FEF | UART_CLEAR_NEF | UART_CLEAR_OREF));
	}
}

